In [1]:
import pandas as pd #Import the library

In [2]:
#Define a dataframe
dicrionary = {"name":["Muhannad","Tarrik","Mustafa"],
              "age":[21,17,22],
              "note":[90,80,70]}

dataframe = pd.DataFrame(dicrionary)
print(dataframe)

       name  age  note
0  Muhannad   21    90
1    Tarrik   17    80
2   Mustafa   22    70

In [3]:
print(dataframe["name"]) #Print name column
print(dataframe.loc[:, "age"]) #Print age column
dataframe["newBill"] = [1,2,3] #Define new column
print(dataframe.loc[:3, "age"]) #Print first 3 in age column
print(dataframe.loc[:3, "name":"note"]) #Print first 3 in name and note columns
print(dataframe.loc[::-1]) #Print the frame starting from the last

0    Muhannad
1      Tarrik
2     Mustafa
Name: name, dtype: object
0    21
1    17
2    22
Name: age, dtype: int64
0    21
1    17
2    22
Name: age, dtype: int64
       name  age  note
0  Muhannad   21    90
1    Tarrik   17    80
2   Mustafa   22    70
       name  age  note  newBill
2   Mustafa   22    70        3
1    Tarrik   17    80        2
0  Muhannad   21    90        1

In [4]:
filter = dataframe.age>18 #Cheack if user older than 18
dataframe["bool"] = filter
print(dataframe.loc[:,["age","bool"]])

   age   bool
0   21   True
1   17  False
2   22   True

In [5]:
filter2 = dataframe.note>50
filtredData = dataframe[filter&filter2]
print(filtredData) #Print the filtred data

       name  age  note  newBill  bool
0  Muhannad   21    90        1  True
2   Mustafa   22    70        3  True

In [6]:
#Drop nulls
dataframe.dropna(inplace=True) 
dataframe

       name  age  note  newBill   bool
0  Muhannad   21    90        1   True
1    Tarrik   17    80        2  False
2   Mustafa   22    70        3   True

In [7]:
#Check which student is above or below agreage
dataframe["situation"]= ["below agreage" if dataframe.note.mean()>each else "above average" for each in dataframe.note]
dataframe

       name  age  note  newBill   bool      situation
0  Muhannad   21    90        1   True  above average
1    Tarrik   17    80        2  False  above average
2   Mustafa   22    70        3   True  below agreage

In [8]:
#A
dataframe["New Bill"] = [1,1,1]
dataframe.columns = [each.split('_')[0] +" "+ each.split('_')[1] if len(each.split('_'))>1 else each for each in dataframe.columns]
dataframe

       name  age  note  newBill   bool      situation  New Bill
0  Muhannad   21    90        1   True  above average         1
1    Tarrik   17    80        2  False  above average         1
2   Mustafa   22    70        3   True  below agreage         1

In [10]:
#convert columns name to uppercase
dataframe.columns = [each.upper() for each in dataframe.columns]
dataframe.columns

Index(['NAME', 'AGE', 'NOTE', 'NEWBILL', 'BOOL', 'SITUATION', 'NEW BILL'], dtype='object')

In [11]:
data1 = dataframe.head()
data2 = dataframe.tail()
data_concat = pd.concat([data1, data2],axis=0)
data_concat

       NAME  AGE  NOTE  NEWBILL   BOOL      SITUATION  NEW BILL
0  Muhannad   21    90        1   True  above average         1
1    Tarrik   17    80        2  False  above average         1
2   Mustafa   22    70        3   True  below agreage         1
0  Muhannad   21    90        1   True  above average         1
1    Tarrik   17    80        2  False  above average         1
2   Mustafa   22    70        3   True  below agreage         1

In [14]:
dataframe["NewAge"] = [each*2 for each in dataframe.AGE]

def mlt(yas):
    return yas*2
dataframe["ApplyMethon"] = dataframe.AGE.apply(mlt)
dataframe

,NAME,AGE,NOTE,NEWBILL,BOOL,SITUATION,NEW BILL,NewAge,ApplyMethon
0,Muhannad,21,90,1,True,above average,1,42,42
1,Tarrik,17,80,2,False,above average,1,34,34
2,Mustafa,22,70,3,True,below agreage,1,44,44